
# 2022.12.13[프뚜]: 배열
list = [1, 2, 3, 4, 5]

# 2022.12.13[프뚜]: 값 조회
list[0] # 1
list[0:2] # [1, 2]
list[2:] # [3, 4, 5]
list[:2] # [1, 2]

# 2022.12.13[프뚜]: 배열 연결
list1 = [1, 2]
list2 = [3, 4, 5]
list1 + list2 # [1, 2, 3, 4, 5]

list1 = [1, 2]
list2 = [3, 4, 5]
list1.extend(list2) # [1, 2, 3, 4, 5]

# 2022.12.13[프뚜]: 배열 복사
list = [1, 2] * 2 # [1, 2, 1, 2]

# 2022.12.13[프뚜]: 배열 길이
list = [1, 2, 3, 4, 5]
len(list)

# 2022.12.13[프뚜]: 값 변경
list = [1, 2, 3, 4, 5]
list[0] = 6 # [6, 2, 3, 4, 5]

# 2022.12.13[프뚜]: index번째 값 제거
list = [1, 2, 3, 4, 5]
del list[0] # [2, 3, 4, 5]

# 2022.12.13[프뚜]: 첫번째 value 값 제거
list = [1, 2, 3, 1, 2]
list.remove(2) # [1, 3, 1, 2]

# 2022.12.13[프뚜]: 원하는 자리에 값 추가
list = [1, 2, 3, 4, 5]
list.insert(0, 6) # [6, 1, 2, 3, 4, 5]

# 2022.12.13[프뚜]: 마지막 자리에 값 추가
list = [1, 2, 3, 4, 5]
list.append(6) # [1, 2, 3, 4, 5, 6]

# 2022.12.13[프뚜]: 정렬
list = [2, 1, 3, 4, 5]
list.sort() # [1, 2, 3, 4, 5]
list.reverse() # [5, 4, 3, 2, 1]

# 2022.12.13[프뚜]: 원하는 값의 index
list = [1, 2, 3, 4, 5]
list.index(2) # 1
list.index(0) # ValueError: 0 is not in list

# 2022.12.13[프뚜]: index 값 꺼내기
list = [1, 2, 3, 4, 5]
list.pop() # 1234
list.pop(0) # 234

# 2022.12.13[프뚜]: 원하는 값과 같은 count 
list = [1, 2, 1, 4, 1]
list.count(1) # 3